/* 
1. Callback & Higher-Order Function มีข้อดีอย่างไร
Answer:
สามารถสร้างจำนวน callback ฟังชั่นได้เยอะดูและแก้ง่ายสามารถเอาไปใช้ได้หลายสถานการณ์



2. จากการลองใช้ Callback Function ในระบบเกมและระบบแจ้งเตือน คุณคิดว่าโค้ดอ่านง่ายขึ้นหรือไม่ เพราะอะไร 
Answer:
้ง่ายขึ้นเพราะ ถ้าเราไม่ได้กำหนดcallback ฟังชั่นเราจำเป็นต้องใช้ if จะทำให้โค้ดยาวกว่าและซับซ่อนกว่า

3. หากต้องสอนเพื่อนให้เข้าใจ Callback & Higher-Order Function ใน 5 นาที จะอธิบายอย่างไร 
Answer:  
Higher-Order function เป็นหัวของfunction ที่จะกำหนดว่าเราจำเป็นต้องไปทำงาน callback ฟังชั้นไหนต่อ
Callback function เป็นการทำงานที่จะรับข้อมูลจาก Higher-Order function และทำงานตามที่กำหนดจากนั้นจะส่งค่าคืนกลับไปให้ Higher-Order function

เริ่มจาการทำให้รู้ก่อนว่า Callback & Higher-Order Functionคืออะไร
ยกตัวอย่างให้เห็นได้ง่าย

action ในเกมส์ 
ถ้าเราไม่มี callback ฟังชั่นจะทำเราต้องกำหนด if_else มาเพื่อตัดสิดเงื่อนไขในการทำงานของ action 
เช่น มีaction 10 อย่าง 
[หลบหลี, โจมตี, ท่าไม่ตาย1,ท่าไม่ตาย2,ท่าไม่ตาย3, ขอความช่วยเหลือ, ป้องกันกายภาพ, ป้องกันเวท, counter-attack,ใช้item]
จะเห็นได้ว่าเราจะมีตัวเลือกให้ใช้เยอะมากและแต่ละตัวเลือกก็มีกดกำหนดการทำงานเข้าไปอีก เช่น
หลบหลี
[สำเร็จ, ไม่สำเร็จ]
โจมตี
[ชนะทาง,แพ้ทาง]
ตัวละครไม่ได้มีตัวเดียวเราจำเป็นต้องกำหนดให้ทุกตัว
ถ้าเรามีการกระทำเยอะตัวโค้ดก็จะเยอะทำให้code รันนาน
หรือเวลาเราจะแก้ไขข้อมูลก็ต้องแก้หลายที่

ส่งผลให้เกมส์กระตุก === เกมส์ห่วย ส่งผลลบต่อเกมส์จะเห็นได้จากความเป็นจริงเวลามีคนบอกว่าเกมส์ optimize ไม่มีเป็นต้น

แต่ถ้าเรามีการทำงาน callback ฟังชั้นอย่างชัดเจนเราจะกำหนดการกระทำให้ไปทำงานที่callback ที่เราต้องการได้เลย
เช่น
Higher-Order function กำหนดการกระทำ
 callback การโจมตี
    callback ชนะธาตุ
    callback แพ้ธาตุ
ตัวละคร ชาวบ้านมีการกระทำแค่หลบหนี, ขอความช่วยเหลือ, ป้องกัน  ไม่จำเป็นต้องกำหนดการกระทำให้แต่เราเอา การกระทำของ callback มาใช้ได้เลย
ทำให้โค้ดทำงานได้เร็วไม่ซับซ้อนเป็นต้น

จะเห็นได้ว่าcallback เริ่มมีการทำงานที่เป็นรู้แบบ

กำหนดให้ ชาวบ้าน การกระทำป้องกัน
Higher-Order function รับคำสั่งมากส่งคำสั่งไปให้callback ฟังชั่น
callback ฟังชั้น รับคำสั่งป้องกัน ส่งค่าความเสียหายที่เกิดขึ้นกลับไปให้ Higher-Order function
Higher-Order function รับค่ามาจาก callback ฟังชั้น ส่งข้อมูลกลับไปที่จุดรับคำสั่ง

ลักษณะการทำงานของallback & Higher-Order Function จะเป็นแบบนี้ 

*/
